axfnull/N32G401_CodeLib/firmware/n32g401f8s7_1_std_periph_driver/inc/n32g401f8s7_1_adc.h
/**
*     Copyright (c) 2022, Nations Technologies Inc.
* 
*     All rights reserved.
*
*     This software is the exclusive property of Nations Technologies Inc. (Hereinafter 
* referred to as NATIONS). This software, and the product of NATIONS described herein 
* (Hereinafter referred to as the Product) are owned by NATIONS under the laws and treaties
* of the People’s Republic of China and other applicable jurisdictions worldwide.
*
*     NATIONS does not grant any license under its patents, copyrights, trademarks, or other 
* intellectual property rights. Names and brands of third party may be mentioned or referred 
* thereto (if any) for identification purposes only.
*
*     NATIONS reserves the right to make changes, corrections, enhancements, modifications, and 
* improvements to this software at any time without notice. Please contact NATIONS and obtain 
* the latest version of this software before placing orders.

*     Although NATIONS has attempted to provide accurate and reliable information, NATIONS assumes 
* no responsibility for the accuracy and reliability of this software.
* 
*     It is the responsibility of the user of this software to properly design, program, and test 
* the functionality and safety of any application made of this information and any resulting product. 
* In no event shall NATIONS be liable for any direct, indirect, incidental, special,exemplary, or 
* consequential damages arising in any way out of the use of this software or the Product.
*
*     NATIONS Products are neither intended nor warranted for usage in systems or equipment, any
* malfunction or failure of which may cause loss of human life, bodily injury or severe property 
* damage. Such applications are deemed, “Insecure Usage”.
*
*     All Insecure Usage shall be made at user’s risk. User shall indemnify NATIONS and hold NATIONS 
* harmless from and against all claims, costs, damages, and other liabilities, arising from or related 
* to any customer’s Insecure Usage.

*     Any express or implied warranty with regard to this software or the Product, including,but not 
* limited to, the warranties of merchantability, fitness for a particular purpose and non-infringement
* are disclaimed to the fullest extent permitted by law.

*     Unless otherwise explicitly permitted by NATIONS, anyone may not duplicate, modify, transcribe
* or otherwise distribute this software for any purposes, in whole or in part.
*
*     NATIONS products and technologies shall not be used for or incorporated into any products or systems
* whose manufacture, use, or sale is prohibited under any applicable domestic or foreign laws or regulations. 
* User shall comply with any applicable export control laws and regulations promulgated and administered by 
* the governments of any countries asserting jurisdiction over the parties or transactions.
**/

/**
*\*\file n32g401f8s7_1_adc.h
*\*\author Nations
*\*\version v1.0.0
*\*\copyright Copyright (c) 2022, Nations Technologies Inc. All rights reserved.
**/

 
#ifndef __N32G401F8S7_1_ADC_H__
#define __N32G401F8S7_1_ADC_H__

#ifdef __cplusplus
extern "C" {
#endif

#include "n32g401f8s7_1.h"
#include <stdbool.h>


/** ADC init structure definition **/
typedef struct
{
    FunctionalState MultiChEn;      /* Specifies whether the conversion is performed in
                                       Scan (multichannels) or Single (one channel) mode */

    FunctionalState ContinueConvEn; /* Specifies whether the conversion is performed in
                                       Continuous or Single mode */

    uint32_t ExtTrigSelect;         /* Defines the external trigger used to start the analog
                                       to digital conversion of regular channels */

    uint32_t DatAlign;              /* Specifies whether the ADC data alignment is left or right */

    uint32_t ChsNumber;             /* Specifies the number of ADC channels that will be converted
                                       using the sequencer for regular channel group */
} ADC_InitType;

typedef enum
{
    CMD_CR_SUCCESS  = 0x00,
    CMD_CR_FAILED   = 0x01,
}CMD_RETURN_CR;


/** ADC scan conversion define **/
#define ADC_MULTCH_ENABLE                    ((uint32_t)(ADC_CTRL1_SCANMD)) /* ADC_CTRL1 SCANMD bits */ 
#define ADC_MULTCH_DISABLE                   ((uint32_t)(~ADC_CTRL1_SCANMD)) 

/** ADC continue conversion define **/
#define ADC_CTU_ENABLE                       ((uint32_t)(ADC_CTRL2_CTU)) /* ADC_CTRL1 CTU bits */
#define ADC_CTU_DISABLE                      ((uint32_t)(~ADC_CTRL2_CTU)) 

/** ADC external trigger sources for regular channels conversion define **/
#define ADC_EXT_TRIGCONV_REGULAR_MASK        ((uint32_t)(~ADC_CTRL2_EXTRSEL)) /* ADC_CTRL2 EXTRSEL[2:0] bits Mask */
#define ADC_EXT_TRIGCONV_REGULAR_T1_CC1      ((uint32_t)0x00000000) 
#define ADC_EXT_TRIGCONV_REGULAR_T1_CC2      ((uint32_t)0x00020000) 
#define ADC_EXT_TRIGCONV_REGULAR_T1_CC3      ((uint32_t)0x00040000)
#define ADC_EXT_TRIGCONV_REGULAR_T2_CC2      ((uint32_t)0x00060000) 
#define ADC_EXT_TRIGCONV_REGULAR_T3_TRGO     ((uint32_t)0x00080000) 
#define ADC_EXT_TRIGCONV_REGULAR_T4_CC4      ((uint32_t)0x000A0000) 
#define ADC_EXT_TRIGCONV_REGULAR_EXT_INT11_TIM8_TRGO ((uint32_t)0x000C0000) 
#define ADC_EXT_TRIGCONV_REGULAR_SWSTRRCH    ((uint32_t)0x000E0000) 

/** ADC data alignment define **/
#define ADC_ALIG_MASK                        ((uint32_t)(~ADC_CTRL2_ALIG)) /* ADC_CTRL2 ALIG bits Mask */
#define ADC_DAT_ALIGN_R                      ((uint32_t)0x00000000)
#define ADC_DAT_ALIGN_L                      ((uint32_t)0x00000800)

/** ADC regular channel sequence length define **/
#define ADC_REGULAR_LEN_MSAK                 ((uint32_t)(~ADC_RSEQ1_LEN)) /* ADC_RSEQ1 LEN[3:0] bits Mask */
#define ADC_REGULAR_LEN_1                    ((uint32_t)0x00000000)
#define ADC_REGULAR_LEN_2                    ((uint32_t)0x00100000)
#define ADC_REGULAR_LEN_3                    ((uint32_t)0x00200000)
#define ADC_REGULAR_LEN_4                    ((uint32_t)0x00300000)
#define ADC_REGULAR_LEN_5                    ((uint32_t)0x00400000)
#define ADC_REGULAR_LEN_6                    ((uint32_t)0x00500000)
#define ADC_REGULAR_LEN_7                    ((uint32_t)0x00600000)
#define ADC_REGULAR_LEN_8                    ((uint32_t)0x00700000)
#define ADC_REGULAR_LEN_9                    ((uint32_t)0x00800000)
#define ADC_REGULAR_LEN_10                   ((uint32_t)0x00900000)
#define ADC_REGULAR_LEN_11                   ((uint32_t)0x00A00000)
#define ADC_REGULAR_LEN_12                   ((uint32_t)0x00B00000)
#define ADC_REGULAR_LEN_13                   ((uint32_t)0x00C00000)
#define ADC_REGULAR_LEN_14                   ((uint32_t)0x00D00000)
#define ADC_REGULAR_LEN_15                   ((uint32_t)0x00E00000)
#define ADC_REGULAR_LEN_16                   ((uint32_t)0x00F00000)

