axfnull/N32G401_CodeLib/firmware/n32g401f8s7_1_std_periph_driver/inc/n32g401f8s7_1_adc.h
/** ADC external trigger sources for injected channels conversion define **/
#define ADC_EXT_TRIGCONV_INJECTED_MASK       ((uint32_t)(~ADC_CTRL2_EXTJSEL)) /* EXTRSEL[2:0] bits Mask */
#define ADC_EXT_TRIGCONV_INJECTED_T1_TRGO    ((uint32_t)0x00000000)
#define ADC_EXT_TRIGCONV_INJECTED_T1_CC4     ((uint32_t)0x00001000) 
#define ADC_EXT_TRIGCONV_INJECTED_T2_TRGO    ((uint32_t)0x00002000) 
#define ADC_EXT_TRIGCONV_INJECTED_T2_CC1     ((uint32_t)0x00003000) 
#define ADC_EXT_TRIGCONV_INJECTED_T3_CC4     ((uint32_t)0x00004000) 
#define ADC_EXT_TRIGCONV_INJECTED_T4_TRGO    ((uint32_t)0x00005000)
#define ADC_EXT_TRIGCONV_INJECTED_EXT_INT15_TIM8_CC4 ((uint32_t)0x00006000) 
#define ADC_EXT_TRIGCONV_INJECTED_SWSTRJCH   ((uint32_t)0x00007000) 

/** ADC injected channels software conversion operation define **/
#define ADC_EXTJTRIG_SWSTRJCH_ENABLE         ((uint32_t)(ADC_CTRL2_EXTJTRIG | ADC_CTRL2_SWSTRJCH))
#define ADC_EXTJTRIG_SWSTRJCH_DISABLE        ((uint32_t)(~(ADC_CTRL2_EXTJTRIG | ADC_CTRL2_SWSTRJCH)))
#define ADC_EXTJTRIG_SWSTRJCH_GET_STS        ((uint32_t)ADC_CTRL2_SWSTRJCH)

/** ADC injected sequence number define **/
#define ADC_INJECTED_NUM_UNIT                ((uint32_t)0x0000001F) 
#define ADC_INJECTED_NUM_UNIT_NUM            ((uint8_t)0x05) 
#define ADC_INJECTED_NUMBER_MASK(num)        ((uint32_t)(~(ADC_INJECTED_NUM_UNIT << ((num) * ADC_INJECTED_NUM_UNIT_NUM))))
#define ADC_INJECTED_NUMBER_SET(ch, num)     ((uint32_t)((ch) << ((num) * ADC_INJECTED_NUM_UNIT_NUM)))
#define ADC_INJECTED_NUMBER_1                ((uint8_t)0x00)
#define ADC_INJECTED_NUMBER_2                ((uint8_t)0x01)
#define ADC_INJECTED_NUMBER_3                ((uint8_t)0x02)
#define ADC_INJECTED_NUMBER_4                ((uint8_t)0x03)

/** ADC injected channel sequence length define **/
#define ADC_INJECTED_LEN_MSAK                ((uint32_t)(~ADC_JSEQ_JLEN)) /* ADC_JSEQ LEN[3:0] bits Mask */
#define ADC_INJECTED_LEN_1                   ((uint32_t)0x00000000) /* Start conversion in the order of 4 */
#define ADC_INJECTED_LEN_2                   ((uint32_t)0x00100000) /* Start conversion in the order of 3, 4 */
#define ADC_INJECTED_LEN_3                   ((uint32_t)0x00200000) /* Start conversion in the order of 2, 3, 4 */
#define ADC_INJECTED_LEN_4                   ((uint32_t)0x00300000) /* Start conversion in the order of 1, 2, 3, 4 */

/** ADC select injected channel registers offset define **/ 
#define ADC_INJECTED_DATA_REG_1              ((uint8_t)0x14)
#define ADC_INJECTED_DATA_REG_2              ((uint8_t)0x18)
#define ADC_INJECTED_DATA_REG_3              ((uint8_t)0x1C)
#define ADC_INJECTED_DATA_REG_4              ((uint8_t)0x20)

/** ADC JDATx registers offset define **/
#define ADC_JDAT_REG_OFFSET                  ((uint8_t)0x28)

/** ADC analog watchdog mode define **/
#define ADC_ANALOG_WTDG_MODE_MASK            ((uint32_t)(~ADC_CTRL1_AWDGSGLEN))
#define ADC_ANALOG_WTDG_SINGLE_MODE          ((uint32_t)ADC_CTRL1_AWDGSGLEN)
#define ADC_ANALOG_WTDG_SCAN_MODE            ((uint32_t)0x00000000)

/** ADC analog watchdog single mode channel define**/
#define ADC_ANALOG_WTDG_SINGLE_CH_MASK       ((uint32_t)(~ADC_CTRL1_AWDGCH))
#define ADC_ANALOG_WTDG_SINGLE_CH0           ((uint8_t)ADC_CH_0)
#define ADC_ANALOG_WTDG_SINGLE_CH1           ((uint8_t)ADC_CH_1)
#define ADC_ANALOG_WTDG_SINGLE_CH2           ((uint8_t)ADC_CH_2)
#define ADC_ANALOG_WTDG_SINGLE_CH3           ((uint8_t)ADC_CH_3)
#define ADC_ANALOG_WTDG_SINGLE_CH4           ((uint8_t)ADC_CH_4)
#define ADC_ANALOG_WTDG_SINGLE_CH5           ((uint8_t)ADC_CH_5)
#define ADC_ANALOG_WTDG_SINGLE_CH6           ((uint8_t)ADC_CH_6)
#define ADC_ANALOG_WTDG_SINGLE_CH7           ((uint8_t)ADC_CH_7)
#define ADC_ANALOG_WTDG_SINGLE_CH8           ((uint8_t)ADC_CH_8)
#define ADC_ANALOG_WTDG_SINGLE_CH10          ((uint8_t)ADC_CH_10)
#define ADC_ANALOG_WTDG_SINGLE_CH17          ((uint8_t)ADC_CH_17)
#define ADC_ANALOG_WTDG_SINGLE_CH18          ((uint8_t)ADC_CH_18)

/** ADC ADC Analog watchdog on regular channels define **/
#define ADC_ANALOG_WTDG_REGULAR              ((uint32_t)ADC_CTRL1_AWDGERCH)    /* ADC_CTRL1 AWDGERCH bit */
/** ADC ADC Analog watchdog on injected channels define **/
#define ADC_ANALOG_WTDG_INJECTED             ((uint32_t)ADC_CTRL1_AWDGEJCH)    /* ADC_CTRL1 AWDGEJCH bit */

/** ADC Temperature sensor and Vrefint define **/
#define ADC_TS_VREFINT_CHANNEL_ENABLE        ((uint32_t)ADC_CTRL2_TEMPEN)      /* ADC_CTRL2 TEMPEN bit */
#define ADC_TS_VREFINT_CHANNEL_DISABLE       ((uint32_t)(~ADC_CTRL2_TEMPEN))  
/* AFEC registers about temperature sensor and vrefint operation define */
#define VREF1P2_CTRL                         (*(uint32_t*)(0x40001800+0x20))
#define _EnVref1p2()                         do{VREF1P2_CTRL|=(1<<10);}while(0);
#define _DisVref1p2()                        do{VREF1P2_CTRL&=~(1<<10);}while(0);

/** ADC flags definition **/
#define ADC_RUN_FLAG                         ((uint8_t)0x01)
#define ADC_RD_FLAG                          ((uint8_t)0x02)

#define ADC_INT_FLAG_AWDG                    ((uint8_t)0x01)
#define ADC_INT_FLAG_ENDC                    ((uint8_t)0x02)
#define ADC_INT_FLAG_JENDC                   ((uint8_t)0x04)
#define ADC_INT_FLAG_ENDCA                   ((uint8_t)0x20)
#define ADC_INT_FLAG_JENDCA                  ((uint8_t)0x40)

#define ADC_FLAG_AWDG                        ((uint8_t)0x01)
#define ADC_FLAG_ENDC                        ((uint8_t)0x02)
#define ADC_FLAG_JENDC                       ((uint8_t)0x04)
#define ADC_FLAG_JSTR                        ((uint8_t)0x08)
#define ADC_FLAG_STR                         ((uint8_t)0x10)
#define ADC_FLAG_ENDCA                       ((uint8_t)0x20)
#define ADC_FLAG_JENDCA                      ((uint8_t)0x40)
/** ADC flags ex definition **/
#define ADC_FLAG_RDY                         ((uint8_t)0x20)
#define ADC_FLAG_PD_RDY                      ((uint8_t)0x40)

/** ADC sample time level define **/
#define ADC_SAMPLE3_TIME_LEVEL_MASK          ((uint32_t)(~ADC_SAMPT3_SAMPSEL))
#define ADC_SAMPLE3_TIME_LEVEL_0             ((uint32_t)0x00000000)
#define ADC_SAMPLE3_TIME_LEVEL_1             ((uint32_t)ADC_SAMPT3_SAMPSEL)

/** ADC clock mode define **/
typedef enum
{
    ADC_CKMOD_AHB = 0,
    ADC_CKMOD_PLL = 1,
}ADC_CKMOD;

/** fllowing bit seg in ex register  **/
/** ADC channels ex style **/
typedef struct
{
    FunctionalState VbatMinitEn;
    FunctionalState DeepPowerModEn;
    FunctionalState JendcIntEn;
    FunctionalState EndcIntEn;
    ADC_CKMOD ClkMode;
    FunctionalState CalAtuoLoadEn;
    FunctionalState DifModCal;
    uint32_t ResBit;
    uint32_t SampSecondStyle;
} ADC_InitTypeEx;

/** ADC_SAMPT3 only have samp time and smp18[2:0],samp18 is refint ch, change to row function **/
/** ADC_IPTST reseverd register ,not to do it **/

/** ADC sampt3 definition **/
#define ADC_SAMPLE_LEVEL_MASK        ((uint32_t)(~ADC_SAMPT3_SAMPSEL))
#define ADC_SAMPLE_LEVEL_0           ((uint32_t)0x00000000)
#define ADC_SAMPLE_LEVEL_1           ((uint32_t)ADC_SAMPT3_SAMPSEL)

